app/views/students/_form.html.erb

		<%= form.label :klass %>
		<%= form.collection_select :klass_id, Klass.all, :id, :name %>
---
SELECT "klasses".* FROM "klasses"