app/views/teachers/_form.html.erb

				<li>
					<%= check_box_tag 'subject_ids[]', s.id, (checked = true if form.object.subject_ids.include?(s.id)) %>
---
SELECT "subjects".id FROM "subjects" INNER JOIN "abilities" ON "subjects"."id" = "abilities"."subject_id" WHERE "abilities"."teacher_id" IS NULL