app/views/teachers/show.html.erb

	<ul>
		<% @teacher.subjects.each do |s| %>
---
SELECT "subjects".* FROM "subjects" INNER JOIN "abilities" ON "subjects"."id" = "abilities"."subject_id" WHERE "abilities"."teacher_id" = 3