app/controllers/contract_types_controller.rb

  def index
    @contract_type = ContractType.all
---
SELECT "contract_types".* FROM "contract_types"

  def show
    @contract_type = ContractType.find(params[:id])
---
SELECT "contract_types".* FROM "contract_types" WHERE "contract_types"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
		@contract_type = ContractType.find(params[:id])
---
SELECT "contract_types".* FROM "contract_types" WHERE "contract_types"."id" = ? LIMIT 1  [["id", "1"]]

  def create
  	@contract_type = ContractType.new(params[:contract_type])
  	respond_to do |format|
    	if @contract_type.save
---
INSERT INTO "contract_types" ("contract_type_id", "created_at", "libelle", "updated_at") VALUES (?, ?, ?, ?)  [["contract_type_id", nil], ["created_at", Thu, 03 May 2012 10:18:46 UTC +00:00], ["libelle", "Contrat Pro"], ["updated_at", Thu, 03 May 2012 10:18:46 UTC +00:00]]

  def update
  	@contract_type = ContractType.find(params[:id])
---
SELECT "contract_types".* FROM "contract_types" WHERE "contract_types"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    ContractType.find(params[:id]).destroy
---
DELETE FROM "contract_types" WHERE "contract_types"."id" = ?  [["id", 1]]
SELECT "contract_types".* FROM "contract_types" WHERE "contract_types"."id" = ? LIMIT 1  [["id", "1"]]