app/controllers/contracts_controller.rb

SELECT "contracts".* FROM "contracts"
---
  def index
    @contracts = Contract.all

SELECT "contracts".* FROM "contracts" WHERE "contracts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "students".* FROM "students" WHERE "students"."contract_id" = 1 LIMIT 1
---
  def show
    @contract = Contract.find(params[:id], :include => [:student, :company, :contract_type])

SELECT "students".* FROM "students"
SELECT "companies".* FROM "companies"
SELECT "contract_types".* FROM "contract_types"
---
  def new
    @new = true
    @contract = Contract.new
    @students = Student.all
    @companies = Company.all
    @contract_types = ContractType.all

SELECT "contracts".* FROM "contracts" WHERE "contracts"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
		@contract = Contract.find(params[:id], :include => [:student, :company, :contract_type])

SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", 3]]
SELECT "contract_types".* FROM "contract_types" WHERE "contract_types"."id" = ? LIMIT 1  [["id", 3]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "contracts" ("created_at", "date_debut", "date_fin", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 03 May 2012 08:33:07 UTC +00:00], ["date_debut", nil], ["date_fin", nil], ["updated_at", Thu, 03 May 2012 08:33:07 UTC +00:00]]
UPDATE "contracts" SET "updated_at" = '2012-05-03 09:56:13.161961' WHERE "contracts"."id" = 7
UPDATE "students" SET "updated_at" = '2012-04-28 15:45:53.627628' WHERE "students"."id" = 3
---
  def create
  	@contract = Contract.new( 	:student => Student.find(params[:contract][:student]),
  										:company => Company.find(params[:contract][:company]),
  										:contract_type => ContractType.find(params[:contract][:contract_type]),
										:date_debut => params[:contract][:date_debut],
										:date_fin => params[:contract][:date_fin])

 		#@contract = Contract.new(params[:contract])
  	respond_to do |format|
    	if @contract.save

DELETE FROM "contracts" WHERE "contracts"."id" = ?  [["id", 1]]
SELECT "contracts".* FROM "contracts" WHERE "contracts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def destroy
    Contract.find(params[:id]).destroy