app/controllers/klasses_controller.rb

SELECT "klasses".* FROM "klasses"
---
  def index
    @klasses = Klass.all

SELECT "klasses".* FROM "klasses" WHERE "klasses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @klass = Klass.find(params[:id])

SELECT "klasses".* FROM "klasses" WHERE "klasses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
      @klass = Klass.find(params[:id])

INSERT INTO "klasses" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 02 May 2012 22:06:03 UTC +00:00], ["name", "SIGL2"], ["updated_at", Wed, 02 May 2012 22:06:03 UTC +00:00]]
---
  def create
    @klass = Klass.new(params[:klass])
    respond_to do |format|
      if @klass.save

SELECT "klasses".* FROM "klasses" WHERE "klasses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @klass = Klass.find(params[:id])