app/controllers/students_controller.rb

  def create
    @user = User.new(:name => params[:student][:name], :email => params[:student][:email], :password => params[:student][:password], :password_confirmation => params[:student][:password])
    if @user.save
---
INSERT INTO "students" ("created_at", "klass_id", "student_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 03 May 2012 10:17:42 UTC +00:00], ["klass_id", nil], ["student_id", nil], ["updated_at", Thu, 03 May 2012 10:17:42 UTC +00:00], ["user_id", 2]]
INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "name", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @student = Student.find(params[:id])
    respond_to do |format|
      if  @student.user.update_attributes(:name => params[:student][:name], :email => params[:student][:email]) && @student.update_attributes(params[:student])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "students" SET "klass_id" = 1, "updated_at" = '2012-05-03 08:08:28.516778' WHERE "students"."id" = 1