app/controllers/subjects_controller.rb

  def edit
      @subject = Subject.find(params[:id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @subject = Subject.new(params[:subject])
    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 18 Apr 2012 19:30:03 UTC +00:00], ["name", nil], ["updated_at", Wed, 18 Apr 2012 19:30:03 UTC +00:00]]

  def update
    @subject = Subject.find(params[:id])

    respond_to do |format|
      if  @subject.update_attributes(params[:subject])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "subjects" SET "name" = 'Mathématiques', "updated_at" = '2012-04-18 19:34:10.070823' WHERE "subjects"."id" = 1

   def destroy
    Subject.find(params[:id]).destroy
---
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 1]]
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", "1"]]