app/controllers/supervisors_controller.rb

  def index
    @supervisors = Supervisor.all
---
SELECT "supervisors".* FROM "supervisors"