app/controllers/teachers_controller.rb

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @teacher = Teacher.find(params[:id])

SELECT "subjects".id FROM "subjects" WHERE "subjects"."teacher_id" IS NULL
---
  def new
    @new = true
    @teacher = Teacher.new
    @subjects = Subject.all

SELECT "subjects".* FROM "subjects"
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
      @subjects = Subject.all
      @teacher = Teacher.find(params[:id])

INSERT INTO "teachers" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", Wed, 18 Apr 2012 17:21:51 UTC +00:00], ["updated_at", Wed, 18 Apr 2012 17:21:51 UTC +00:00], ["user_id", 5]]
INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "name", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "abilities" ("created_at", "subject_id", "teacher_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 18 Apr 2012 20:05:12 UTC +00:00], ["subject_id", 5], ["teacher_id", 2], ["updated_at", Wed, 18 Apr 2012 20:05:12 UTC +00:00]]
INSERT INTO "subjects" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 18 Apr 2012 20:05:12 UTC +00:00], ["name", nil], ["updated_at", Wed, 18 Apr 2012 20:05:12 UTC +00:00]]
---
  def create
    @user = User.new(:name => params[:teacher][:name], :email => params[:teacher][:email], :password => params[:teacher][:password], :password_confirmation => params[:teacher][:password])

    if @user.save
      @teacher = @user.teachers.build
      @teacher.name = @teacher.user.name
      @teacher.email = @teacher.user.email
      respond_to do |format|
        if @teacher.save
          if !params[:subject_ids].blank?
            params[:subject_ids].each do |id|
              @teacher.abilities.create(:subject_id => id)

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @teacher = Teacher.find(params[:id])

DELETE FROM "teachers" WHERE "teachers"."id" = ?  [["id", 4]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
   def destroy
    Teacher.find(params[:id]).user.destroy