app/views/klasses/show.html.erb

SELECT "students".* FROM "students" WHERE "students"."klass_id" = 1
---
	<ul>
		<% @klass.students.each do |s| %>